{
  "posts": [
    {
      "id": 1,
      "category": "Новости",
      "title": "Начало космической компании",
      "description": "Произведенна попытка полета ежей на луну. Увы взлететь не удалось из за нехватки топлива. Горошек в баночке кончисля быстрее чем расчитали наши многоуважаемые ученые",
      "mainImage": "space_companny.jpg",
      "body": "<p>Hello!</p>",
      "date": "1920-10-12",
      "author": "Ezik"
    },
    {
      "id": 2,
      "category": "Околонеучные статьи",
      "title": "Происхождение ежических богов",
      "description": "Ни как не удается соотнести богов (полубогов) индийской и славяно арийской культуры. Хочешь что то спрятать, положи на видное место. В массы пошла информация что",
      "mainImage": "half-god.jpg",
      "body": "<p>Hello!</p>",
      "date": "1920-10-13",
      "author": "Ezik"
    },
    {
      "id": 3,
      "category": "Околонеучные статьи",
      "title": "Родня ли мы хобиттам?",
      "description": "Есть очень много схожестей: мохнатые лапки, привычка часто и вкусно кушать, любовь к растениям, проживание в норках и т.д. Но что об этом говорят наши генетики?",
      "mainImage": "hobbit-family.jpg",
      "body": "<p>Однажы, холодным зимнем вечером я сидел у окна и размышлял о фсячиских проблемах вселенского масштаба. Да да, я выпал из спячки чтобы проверить целостность своих запасов в кладовке. Все было так же как я оставил осенью. И вот я взял туесок с сушёными ломтиками болгарского перца 1972-го года, умопомрачительный аромат, словами не передашь а делиться жалко :) Усевшись поудобнее в своем старинном кресле вместе с перчиками и блюдечком иван чая, я начал думать.<p>Мысль про схожесть с хоббитами пришла когда я уже сточил пол туеска перчика и допивал третье блюдце чая. Живут они по большей части в норках в земле. Не особо любят высоту, хотя это у кого как, вот я, например, люблю прыгать с верхушек ёлок в сугробы. Надо будет завтра раз уж я выпал из спячки, если проснусь конечно, хотя нет, после трех блюдцев чая точно проснусь, куда я денусь? Прошу прощения, отвлекся.</p><p>И мы и хоббиты очень любим много и вкусно покушать. Правда вкусы у нас довольно сильно отличаются. Мясов, рыбов и яйцев мы в пищу не употребляем (наскомые не в счет). Пропавшим виноградным соком не балуемся и вам не советуем. Пожалуй еще одно не соответсвие заключается в том что гадкие хоббитсы любят курить всякую гадость в отличии от нас, мы только иногда дышим огнем когда съедаем тоненький красный перчик (чили называется).</p><p>Зато и мы и хоббиты очень любим огороды. У хоббитов есть свои огороды и поля где они любят работать. У нас своих огородов и полей обычно нету и мы шастаем по чужим. Вы не подумайте - мы не воры и не вредители, даже наоборот, мы ловим вредителей в огородах и проводим воспитательные работы. За свою работу, мы берем с огорода долю продуктов которую без нас бы съели вредители, а потом побыстрее двигаем лапками ибо не все хозяева огородов признают нашу воспитательную методику и наровят воспитать нас. Если нас удается догнать, мы делаем глаза бусинки, встаем на передние лапки и идем куда шли под не печатные восклицания хозяинов огородов.</p><p>Что еще, что еще? А точно! Мохнатые лапки без обуви! Ну ладно, подведем итоги. Думать слишком много вредно, может распухнуть голова и тогда не налезет шапка, а новая шапка это большие затраты (о том как ежи добывают шапки, можно почитать <a href=\"/bloh/1\">здесь</a>). Все так родня мы хоббитам или нет? А хрен его знает, о нужно достать банку с хреном из кладовки! На этой веселой ноте я закончю эту статью и пойду спать.</p>",
      "date": "Первое декабря, 2022 год",
      "author": "Еж вылетевший из института антропологических исследований за плохое поведение"
    },
    {
      "id": 4,
      "category": "Кулинарные рецепты",
      "title": "Как приготовть селенберендюк",
      "description": "История этого восхитительного блюда берет свое начало в далеком дремучем предремучем лесу. Там жила одна пожилая и по тому безсташная ежиха. В процессе приготовления завтрака она",
      "mainImage": "eziha.jpg",
      "body": "<p>Hello!</p>",
      "date": "1920-10-14",
      "author": "Ezik"
    },
    {
      "id": 5,
      "category": "Аналитика",
      "title": "Про буков бяков",
      "description": "Раскажем про Буков Бяков, эх!\n Как терпит их земля, лю-лю-лю ля-ля-ля-ля. Конечно наш очередной выпуск газеты 'Безсовестная ложь' будет про ежиков",
      "mainImage": "way-poem.jpg",
      "body": "<p>Hello!</p>",
      "date": "1920-10-14",
      "author": "Ezik"
    }
  ],

  "post-categories": [
    {
      "id": 1,
      "name": "Новости",
      "color": "#e4e4e4"
    },
    {
      "id": 2,
      "name": "Околонеучные статьи",
      "color": "#c0ffff"
    },
    {
      "id": 3,
      "name": "Кулинарные рецепты",
      "color": "#ffd3e8"
    },
    {
      "id": 4,
      "name": "Очерки",
      "color": "#daffd3"
    },
    {
      "id": 5,
      "name": "Важные объявления",
      "color": "#ffd3d3"
    },
    {
      "id": 6,
      "name": "Не важные объявления",
      "color": "#fffad1"
    },
    {
      "id": 7,
      "name": "Здоровье",
      "color": "#c2ffc0"
    },
    {
      "id": 8,
      "name": "Самоляпки",
      "color": "#989cff"
    },
    {
      "id": 9,
      "name": "Расказы, повести",
      "color": "#a6ffea"
    },
    {
      "id": 10,
      "name": "Аналитика",
      "color": "#f8ffa6"
    },
    {
      "id": 11,
      "name": "Рекламы",
      "color": "#ffe3d3"
    },
    {
      "id": 12,
      "name": "Всяка",
      "color": "#ff7fed"
    }
  ],
  "humor-pump": [
    {
      "id": 1,
      "text": "Жор напал не ожиданно, из под тишка. Но наши бравые ёжики выдержали не равный бой и вышли из него победителями. В честь гарндиозной победы был устроен пир на весь мир и его окресности."
    },
    {
      "id": 2,
      "text": "Шапка невидимка, постоянно теряется Саппоги скороходы, ходят быстро но отдельно от хозяина Ковер самолет, та же история..."
    }
  ]
}
